id: suricata
name: Suricata
author: Tenzir
author_icon: https://github.com/tenzir.png
package_icon: https://suricata.io/wp-content/uploads/2023/09/Logo-Suricata-vert-R.png

description: |
  A package to simplify the onboarding of logs emitted from a Suricata
  instance.

inputs:
  eve-path:
    name: EVE Path
    description: A path where suricata writes eve.json formatted logs
    type: string
    default: /var/lib/suricata/eve.sock

pipelines:
  publish:
    name: Suricata Publish
    description: Ingest Suricata events into a subscription topic.
    restart-on-error: 5m
    definition: |
      from file {{ inputs.eve-path }} --follow read suricata
      | publish suricata

  suricata-flow-to-ocsf:
    name: Suricata Flow to OCSF Network Activity
    description: Maps Suricata Flow events to an OCSF Network Activity event.
    restart-on-error: 5m
    definition: |
      subscribe "suricata"
      where @name == "suricata.flow"
      python "self.flow_uid = str(self.flow_id)"
      this = {
        type_uid: 400106,
        src_endpoint: {
          ip: src_ip,
          port: src_port,
        },
        dst_endpoint: {
          ip: dest_ip,
          port: dest_port,
        },
        severity_id: 1,
        metadata: {
          version: "v1.3.0",
          product: {
            name: "Suricata",
            vendor_name: "Open Information Security Foundation",
          },
          uid: flow_uid,
        },
        time: timestamp,
        class_uid: 4001,
        category_uid: 4,
        activity_id: 6,
        traffic: {
          bytes_in: flow.bytes_toclient,
          bytes_out: flow.bytes_toserver,
          packets_in: flow.pkts_toclient,
          packets_out: flow.pkts_toserver,
          bytes: flow.bytes_toclient + flow.bytes_toserver,
          packets: flow.pkts_toclient + flow.pkts_toserver,
        },
        status_id: 99,
        status: flow.state,
      }

  suricata-dns-to-ocsf:
    name: Suricata DNS to OCSF Network Activity
    description: Maps Suricata DNS events to an OCSF DNS Activity event.
    restart-on-error: 5m
    definition: |
      subscribe "suricata"
      where @name == "suricata.dns"
      python "self.flow_uid = str(self.flow_id)"
      if (dns.rcode == "NOERROR") {
        rcode_id = 0
        rcode = "NoError"
      } else if (dns.rcode == "FORMERROR") {
        rcode_id = 1
        rcode = "FormError"
      } else if (dns.rcode == "SERVERROR") {
        rcode_id = 2
        rcode = "ServError"
      } else if (dns.rcode == "NXDOMAIN") {
        rcode_id = 3
        rcode = "NxDomain"
      } else if (dns.rcode == "NOTIMP") {
        rcode_id = 4
        rcode = "NotImp"
      } else if (dns.rcode == "REFUSED") {
        rcode_id = 5
        rcode = "Refused"
      } else if (dns.rcode == "YXDOMAIN") {
        rcode_id = 6
        rcode = "YXDomain"
      } else if (dns.rcode == "YXRRSET") {
        rcode_id = 7
        rcode = "YXRRSet"
      } else if (dns.rcode == "NXRRSET") {
        rcode_id = 8
        rcode = "NXRRSet"
      } else if (dns.rcode == "NOTAUTH") {
        rcode_id = 9
        rcode = "NotAuth"
      } else if (dns.rcode == "NOTZONE") {
        rcode_id = 10
        rcode = "NotZone"
      } else if (dns.rcode == "DSOTYPENI") {
        rcode_id = 11
        rcode = dns.rcode
      } else if (dns.rcode == "BADSIG_VERS") {
        rcode_id = 16
        rcode = dns.rcode
      } else if (dns.rcode == "BADKEY") {
        rcode_id = 17
        rcode = dns.rcode
      } else if (dns.rcode == "BADTIME") {
        rcode_id = 18
        rcode = dns.rcode
      } else if (dns.rcode == "BADMODE") {
        rcode_id = 19
        rcode = dns.rcode
      } else if (dns.rcode == "BADNAME") {
        rcode_id = 20
        rcode = dns.rcode
      } else if (dns.rcode == "BADALG") {
        rcode_id = 21
        rcode = dns.rcode
      } else if (dns.rcode == "BADTRUNC") {
        rcode_id = 22
        rcode = dns.rcode
      } else if (dns.rcode == "BADCOOKIE") {
        rcode_id = 23
        rcode = dns.rcode
      } else {
        rcode_id = 99
        rcode = dns.rcode
      }
      this = {
        type_uid: 400306,
        src_endpoint: {
          ip: src_ip,
          port: src_port,
        },
        dst_endpoint: {
          ip: dest_ip,
          port: dest_port,
        },
        severity_id: 1,
        metadata: {
          version: "v1.3.0",
          product: {
            name: "Suricata",
            vendor_name: "Open Information Security Foundation",
          },
          uid: flow_uid,
        },
        time: timestamp,
        class_uid: 4003,
        category_uid: 4,
        activity_id: 6,
        status_id: 1,
        rcode_id: rcode_id,
        rcode: rcode,
        query: {
          hostname: dns.queries[0].rrname,
          type: dns.queries[0].rrtype,
        },
        unmapped: {
          grouped: dns.grouped,
          answers: dns.answers
        },
      }

  suricata-smb-to-ocsf:
    name: Suricata SMB to OCSF Network Activity
    description: Maps Suricata SMB events to an OCSF SMB Activity event.
    restart-on-error: 5m
    definition: |
      subscribe "suricata"
      where @name == "suricata.smb"
      python "self.flow_uid = str(self.flow_id)"
      if smb.status_code == "0x0" {
        status_id = 1
        status = "Success"
      } else {
        status_id = 99
        status = smb.status
      }
      if smb.disposition == "FILE_SUPERSEDE" {
        type_uid = 400601
        activity_id = 1
        activity_name = "File Supersede"
      } else if smb.disposition == "FILE_OPEN" {
        type_uid = 400602
        activity_id = 2
        activity_name = "File Open"
      } else if smb.disposition == "FILE_CREATE" {
        type_uid = 400603
        activity_id = 3
        activity_name = "File Create"
      } else if smb.disposition == "FILE_OPEN_IF" {
        type_uid = 400604
        activity_id = 4
        activity_name = "File Open If"
      } else if smb.disposition == "FILE_OVERWRITE" {
        type_uid = 400605
        activity_id = 5
        activity_name = "File Overwrite"
      } else if smb.disposition == "FILE_OVERWRITE_IF" {
        type_uid = 400606
        activity_id = 6
        activity_name = "File Overwrite If"
      } else {
        type_uid = 400699
        activity_id = 99
        activity_name = smb.command
      }
      this = {
        type_uid: 400699,
        src_endpoint: {
          ip: src_ip,
          port: src_port,
        },
        dst_endpoint: {
          ip: dest_ip,
          port: dest_port,
        },
        severity_id: 1,
        metadata: {
          version: "v1.3.0",
          product: {
            name: "Suricata",
            vendor_name: "Open Information Security Foundation",
          },
          uid: flow_uid,
        },
        time: timestamp,
        status_id: status_id,
        status: status,
        class_uid: 4006,
        category_uid: 4,
        activity_id: activity_id,
        activity_name: activity_name,
        file: {
          type_id: 0,
          name: smb.filename,
          created_time: smb.created,
          modified_time: smb.modified,
          accessed_time: smb.accessed,
        },
        tree_uid: smb.tree_id,
        dialect: smb.dialect,
      }

  suricata-alert-to-ocsf:
    name: Suricata Alert to OCSF Detection Finding Activity
    description: Maps Suricata Alert events to an OCSF Detection Finding Activity event.
    restart-on-error: 5m
    definition: |
      subscribe "suricata"
      where @name == "suricata.alert"
      python "self.flow_uid = str(self.flow_id)"
      if alert.severity == null {
        severity_id = 0
      } else if alert.severity == 1 {
        severity_id = 4
      } else if alert.severity == 2 {
        severity_id = 3
      } else if alert.severity == 3 {
        severity_id = 2
      }
      this = {
        type_uid: 200401,
        src_endpoint: {
          ip: src_ip,
          port: src_port,
        },
        dst_endpoint: {
          ip: dest_ip,
          port: dest_port,
        },
        severity_id: severity_id,
        metadata: {
          version: "v1.3.0",
          product: {
            name: "Suricata",
            vendor_name: "Open Information Security Foundation",
          },
          uid: flow_uid,
        },
        activity_id: 1,
        time: timestamp,
        status_id: 1,
        class_uid: 2004,
        category_uid: 2,
        finding_info: {
          title: alert.category,
          desc: alert.signature,
        },
      }

  suricata-http-to-ocsf:
    name: Suricata HTTP to OCSF HTTP Activity
    description: Maps Suricata Alert events to an OCSF HTTP Activity event.
    restart-on-error: 5m
    definition: |
      subscribe "suricata"
      where @name == "suricata.http"
      python "self.flow_uid = str(self.flow_id)"
      if http.http_method == null {
        type_uid = 400200
        activity_id = 0
        activity_name = "Unknown"
      } else if http.http_method == "CONNECT" {
        type_uid = 400201
        activity_id = 1
        activity_name = "Connect"
      } else if http.http_method == "DELETE" {
        type_uid = 400202
        activity_id = 2
        activity_name = "Delete"
      } else if http.http_method == "GET" {
        type_uid = 400203
        activity_id = 3
        activity_name = "Get"
      } else if http.http_method == "HEAD" {
        type_uid = 400204
        activity_id = 4
        activity_name = "Head"
      } else if http.http_method == "OPTIONS" {
        type_uid = 400205
        activity_id = 5
        activity_name = "Options"
      } else if http.http_method == "POST" {
        type_uid = 400206
        activity_id = 6
        activity_name = "Post"
      } else if http.http_method == "PUT" {
        type_uid = 400207
        activity_id = 7
        activity_name = "Put"
      } else if http.http_method == "TRACE" {
        type_uid = 400208
        activity_id = 8
        activity_name = "Trace"
      } else {
        type_uid = 400299
        activity_id = 99
        activity_name = http.http_method
      }
      if http.status == null {
        status_id = 0
      } else if http.status >= 200 and http.status < 400 {
        status_id = 1
      } else if http.status >= 400 and http.status < 600 {
        status_id = 2
      }
      this = {
        type_uid: type_uid,
        src_endpoint: {
          ip: src_ip,
          port: src_port,
        },
        dst_endpoint: {
          ip: dest_ip,
          port: dest_port,
        },
        severity_id: 1,
        metadata: {
          version: "v1.3.0",
          product: {
            name: "Suricata",
            vendor_name: "Open Information Security Foundation",
          },
          uid: flow_uid,
        },
        time: timestamp,
        status_id: status_id,
        class_uid: 4002,
        category_uid: 4,
        activity_id: activity_id,
        activity_name: activity_name,
        http_request: {
          url: {
            hostname: http.hostname,
            url_string: http.url,
          },
          version: http.protocol,
          http_method: http.http_method,
          user_agent: http.http_user_agent,
        },
        http_response: {
          code: http.status,
          length: http.length,
          content_type: http.http_content_type,
        },
      }

  suricata-fileinfo-to-ocsf:
    name: Suricata Fileinfo to OCSF HTTP Activity
    description: Maps Suricata Fileinfo events to an OCSF HTTP Activity event.
    restart-on-error: 5m
    definition: |
      subscribe "suricata"
      where @name == "suricata.fileinfo"
      python "self.flow_uid = str(self.flow_id)"
      if http.http_method == null {
        type_uid = 400200
        activity_id = 0
        activity_name = "Unknown"
      } else if http.http_method == "CONNECT" {
        type_uid = 400201
        activity_id = 1
        activity_name = "Connect"
      } else if http.http_method == "DELETE" {
        type_uid = 400202
        activity_id = 2
        activity_name = "Delete"
      } else if http.http_method == "GET" {
        type_uid = 400203
        activity_id = 3
        activity_name = "Get"
      } else if http.http_method == "HEAD" {
        type_uid = 400204
        activity_id = 4
        activity_name = "Head"
      } else if http.http_method == "OPTIONS" {
        type_uid = 400205
        activity_id = 5
        activity_name = "Options"
      } else if http.http_method == "POST" {
        type_uid = 400206
        activity_id = 6
        activity_name = "Post"
      } else if http.http_method == "PUT" {
        type_uid = 400207
        activity_id = 7
        activity_name = "Put"
      } else if http.http_method == "TRACE" {
        type_uid = 400208
        activity_id = 8
        activity_name = "Trace"
      } else {
        type_uid = 400299
        activity_id = 99
        activity_name = http.http_method
      }
      if http.status == null {
        status_id = 0
      } else if http.status >= 200 and http.status < 400 {
        status_id = 1
      } else if http.status >= 400 and http.status < 600 {
        status_id = 2
      }
      this = {
        type_uid: type_uid,
        src_endpoint: {
          ip: src_ip,
          port: src_port,
        },
        dst_endpoint: {
          ip: dest_ip,
          port: dest_port,
        },
        severity_id: 1,
        metadata: {
          version: "v1.3.0",
          product: {
            name: "Suricata",
            vendor_name: "Open Information Security Foundation",
          },
          uid: flow_uid,
        },
        time: timestamp,
        status_id: status_id,
        class_uid: 4002,
        category_uid: 4,
        activity_id: activity_id,
        activity_name: activity_name,
        http_request: {
          url: {
            hostname: http.hostname,
            url_string: http.url,
          },
          version: http.protocol,
          http_method: http.http_method,
          user_agent: http.http_user_agent,
        },
        http_response: {
          code: http.status,
          length: http.length,
          content_type: http.http_content_type,
        },
        file: {
          type_id: 0,
          name: fileinfo.filename,
          size: fileinfo.size,
        },
      }

snippets:
  - name: Todays Alerts
    description: Display all Suricata alerts from the last 24 hours.
    definition: |
      export
      | where #schema == "suricata.alert"
      | where #import_time > 1 day ago
